app/Http/Controllers/API/v1/BetController.php

select * from `bets_today`
select * from `bet_games` where `bet_games`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $bets = DB::table('bets_today')->get();
        $gameTypes = BetGame::all();