app/Http/Controllers/API/v1/PermissionController.php

select * from `permissions` where `name` like '%%' limit 10 offset 0
select count(*) as aggregate from `permissions` where `name` like '%%'
---
    public function index(Request $request)
    {
        $this->authorize('list', Permission::class);

        $search = $request->get('search', '');
        $permissions = Permission::where('name', 'like', "%{$search}%")->paginate(10);