app/Http/Controllers/API/v1/PermissionController.php

    public function create()
    {
        $this->authorize('create permissions', Permission::class);

        $roles = Role::all();
---
select * from `roles`